// Напишите программу вычисления модуля числа.
// 2 -> 2
// -3 -> 3
// -7 -> 7


Console.Write("Введи число: ");
int num = int.Parse(Console.ReadLine());


if(num > 0) System.Console.WriteLine(num);
else System.Console.WriteLine(-num);