// Напишите программу вычисления куба числа

Console.Write("Введи число: ");
int num = int.Parse(Console.ReadLine());

int cube = num * num * num;

System.Console.WriteLine("Куб числа " + num + " равен " + cube);
